#pragma once
#include "banner.h"

#include <iostream>

namespace toyinfer {

void Utils::print_banner() {
    const char* banner =
        R"(

████████╗ ██████╗ ██╗   ██╗██╗███╗   ██╗███████╗███████╗██████╗ 
╚══██╔══╝██╔═══██╗╚██╗ ██╔╝██║████╗  ██║██╔════╝██╔════╝██╔══██╗
   ██║   ██║   ██║ ╚████╔╝ ██║██╔██╗ ██║█████╗  █████╗  ██████╔╝
   ██║   ██║   ██║  ╚██╔╝  ██║██║╚██╗██║██╔══╝  ██╔══╝  ██╔══██╗
   ██║   ╚██████╔╝   ██║   ██║██║ ╚████║██║     ███████╗██║  ██║
   ╚═╝    ╚═════╝    ╚═╝   ╚═╝╚═╝  ╚═══╝╚═╝     ╚══════╝╚═╝  ╚═╝
                                                                
)";

    std::cout << banner << std::endl;
    std::cout << "ToyInfer: Pure CUDA kernel implementation of Qwen3-4B "
                 "inference engine."
              << std::endl;
    std::cout << "Author: Wiketool" << std::endl;
}
}  // namespace toyinfer